Repository: davidbrochart/language-packs
Catalog: extensions/jupyterlab_git/locale/*/LC_MESSAGES/jupyterlab_git.po
Languages: ja_jp, ru_ru

source: Suspend user interaction until commands finish
ja_jp: コマンドが終了するまでユーザーの操作を中断する
ru_ru: Приостановить взаимодействие с пользователем, пока команды не закончат выполнение

# schema
source: Suspend JupyterLab user interaction until Git commands (e.g., commit, pull, reset, revert) finish executing. Setting this to true helps mitigate potential race conditions leading to data loss, conflicts, and a broken Git history. Unless running a slow network, UI suspension should not interfere with standard workflows. Setting this to false allows for actions to trigger multiple concurrent Git actions.
ja_jp: Git コマンド (例: コミット、プル、リセット、リバート) が実行を終了するまで、JupyterLab ユーザーの操作を停止します。 true に設定する事で、データの損失、コンフリクト、および Git 履歴の破損などの競合状態が発生する可能性を軽減できます。 低速ネットワークを使用していない限り、UI 操作の停止は標準的なワークフローに影響することはありません。false に設定した場合は、複数の 同時進行の Git 操作をトリガーすることが可能です。
ru_ru: Приостановить взаимодействие с пользователем JupyterLab, пока команды Git (например commit, pull, reset, revert) не закончат выполнение. Установка значения истина (true) помогает не допустить потенциальные состояния гонки, приводящие к потере данных, конфликтам и сбою истории Git. Приостановка взаимодействия с интерфейсом не мешает работе за исключением медленного соединения. Установка значения ложь (false) позволит действиям выполнять несколько одновременных Git операций.

source: Cancel pull merge conflict
ja_jp: プル リクエストのマージのコンフリクトをキャンセルする
ru_ru: Отменить конфликт слияния

# schema
source: If true, when fetching and integrating changes from a remote repository, a conflicting merge is canceled and the working tree left untouched.
ja_jp: true の場合、リモートリポジトリから変更を取得および統合する際にマージにコンフリクトが発生した場合、マージはキャンセルされ、作業ツリーには変更は適用されません。
ru_ru: Если установлено значение истина (true), то при извлечении и интеграции изменений из удаленного репозитория, конфликтующее слияние будет отменено, а рабочее дерево оставлено нетронутым.

source: Disable branch with changes
ja_jp: 変更のあるブランチを無効にする
ru_ru: Отключить ветку с изменениями

# schema
source: Disable all branch operations (new, switch) when there are changed/staged files
ja_jp: 変更/ステージングファイルがある場合、すべてのブランチ操作(新規、スイッチ) を無効にする
ru_ru: Отключить все операции ветки (new, switch) если есть измененные/индексированные файлы

source: Display Git status updates
ja_jp: Git ステータスの更新を表示
ru_ru: Отображать обновления статуса Git

# schema
source: Display Git extension status updates in the JupyterLab status bar. If true, the extension displays status updates in the JupyterLab status bar, such as when pulling and pushing changes, switching branches, and polling for changes. Depending on the level of extension activity, some users may find the status updates distracting. In which case, setting this to false should reduce visual noise.
ja_jp: JupyterLabステータスバーに Git extension のステータスの最新情報を表示します。 true の場合、変更のプルおよびプッシュ、ブランチの切り替え、変更のポーリングなどを行う際に JupyterLab のステータスバーに、extension のステータスの最新情報を表示します。Extension のアクティビティのレベルが高く、ステータスの更新が目障りな場合は false に設定する事で、視覚的なノイズを減らす事が出来ます。
ru_ru: Отображать статус Git в строке состояния JupyterLab. Если установлено значение истина (true), расширение отображает обновления статуса в строке состояния JupyterLab, например, при получении и отправке изменений, переключении веток и голосовании за изменения. В зависимости от уровня активности расширения, обновления статуса могут показаться некоторым пользователям отвлекающими. В таком случае установка значения false должно уменьшить зрительный шум.

source: Show diff on double click
ja_jp: ダブルクリックで差分を表示
ru_ru: Показать diff при двойном щелчке

# schema
source: If true, doubling clicking a file in the list of changed files will open a diff.
ja_jp: true の場合、変更されたファイルのリスト内のファイルをダブルクリックすると diff が開きます。
ru_ru: Если установлено значение true, двойной щелчок по файлу в списке измененных файлов откроет diff.

source: History count
ja_jp: 履歴カウント
ru_ru: Размер истории

# schema
source: Number of (most recent) commits shown in the history log
ja_jp: 履歴ログに表示される(直近の)コミット数
ru_ru: Количество недавних коммитов отображаемых в истории

source: Refresh interval
ja_jp: 更新間隔
ru_ru: Частота обновления

# schema
source: Number of milliseconds between polling the file system for changes.
ja_jp: ファイル システムを変更するポーリングの間のミリ秒数。
ru_ru: Количество миллисекунд между опросом файловой системы на предмет изменений.

# schema
source: jupyterlab-git settings.
ja_jp: jupyterlab-git の設定。
ru_ru: Настройки jupyterlab-git.

source: Simple staging flag
ja_jp: 簡易ステージング フラグ
ru_ru: Простой флаг индекса

# schema
source: If true, use a simplified concept of staging. Only files with changes are shown (instead of showing staged/changed/untracked), and all files with changes will be automatically staged
ja_jp: true の場合、簡略化されたステージングを使用します。従来の staged / changed / untracked の代わりに、変更のあるファイルのみが表示され、変更のあるファイルはすべて自動的に staged 状態になります。
ru_ru: Если включено (true), будет использовано упрощенное индексирование. Будут показаны только файлы с изменениями (вместо отображения индексированых/измененных/неотслеживаемых), и все файлы с изменениями будут автоматически индексированы
